tap "homebrew/bundle"
tap "homebrew/services"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Automate deployment, configuration, and upgrading
brew "ansible"
# New file format for still image compression
brew "jpeg-xl"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Modern, maintained replacement for ls
brew "eza"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Deep clean and optimize your Mac
brew "mole"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk"
# General-purpose scripting language
brew "php"
# Fast, disk space efficient package manager
brew "pnpm"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Safe, concurrent, practical language
brew "rust"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Official tldr client written in Rust
brew "tlrc"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Application uninstaller
cask "appcleaner"
# Web debugging Proxy application
cask "charles"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Databases and SQL IDE
cask "datagrip"
cask "font-cascadia-code-pl"
# Game development engine
cask "godot"
# Desktop automation application
cask "hammerspoon"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Menu bar calendar
cask "itsycal"
# Multi-platform web browser
cask "microsoft-edge"
# Replacement for Docker Desktop
cask "orbstack"
# Collaboration platform for API development
cask "postman"
# Messaging app with a focus on speed and security
cask "telegram"
# Unpacks archive files
cask "the-unarchiver"
# Open-source code editor
cask "visual-studio-code"
vscode "alefragnani.bookmarks"
vscode "antfu.icons-carbon"
vscode "antfu.retypewriter"
vscode "antfu.theme-vitesse"
vscode "anthropic.claude-code"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "bierner.markdown-preview-github-styles"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "codingyu.laravel-goto-view"
vscode "davidanson.vscode-markdownlint"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "felicio.vscode-fold"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "hbenl.vscode-test-explorer"
vscode "kisstkondoros.vscode-codemetrics"
vscode "mattpocock.ts-error-translator"
vscode "mehedidracula.php-namespace-resolver"
vscode "mikestead.dotenv"
vscode "ms-ceintl.vscode-language-pack-zh-hant"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-typescript-next"
vscode "neilbrayfield.php-docblocker"
vscode "onecentlin.laravel-blade"
vscode "onecentlin.laravel5-snippets"
vscode "openai.openai-chatgpt-adhoc"
vscode "pflannery.vscode-versionlens"
vscode "prisma.prisma"
vscode "prisma.prisma-insider"
vscode "shardulm94.trailing-spaces"
vscode "streetsidesoftware.code-spell-checker"
vscode "stringham.move-ts"
vscode "timkmecl.chatgpt"
vscode "vue.volar"
vscode "wayou.vscode-todo-highlight"
vscode "xdebug.php-debug"
vscode "xdebug.php-pack"
vscode "zignd.html-css-class-completion"
vscode "zobo.php-intellisense"
go "api-test"
go "github.com/spf13/cobra-cli"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/fatih/gomodifytags"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/josharian/impl"
go "github.com/yinheli/sshw/cmd/sshw"
go "honnef.co/go/tools/cmd/staticcheck"
